Revit 2024 API
BuiltInFailures.TrussFailures.TrussLayoutNonSympleTopChord Property
 This truss layout family defines an offset or non horizontal top chord. This may conflict with attachment or profile editing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TrussLayoutNonSympleTopChord { get; }
Visual Basic
Public Shared ReadOnly Property TrussLayoutNonSympleTopChord As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TrussLayoutNonSympleTopChord {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace